src/Documents/ИС_WB_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_УпаковкаТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПечатиШтрихкодов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_ПоставкиFBS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьЭтикеткиЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьШтрихкоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОтправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеQR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусWB</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСборки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_MP_СтатусыСборки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркируемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркировкаПередана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КИЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_ПоставкиFBS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусWB</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этикетка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ДанныеВыгрузкиКИЗов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ДанныеВыгрузкиКИЗов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыгруженныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_АЛИ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_MP_СтатусыСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_MP_СтатусыСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>waiting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>sorted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>sold</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>canceled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>canceled_by_client</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>declined_by_client</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>defect</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ready_for_pickup</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>postponed_delivery</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>reject</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>canceled_by_missed_call</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CnC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_WB_УпаковкаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("Профиль") Тогда	
			Объект.Профиль = Параметры.Профиль;
		КонецЕсли;
				
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчанию();     
	
	Если ЗначениеЗаполнено(Объект.Поставка) Тогда
		//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970		
		ЗаполнитьДанныеСборкиНаСервере(Истина);          
		//ЗаполнитьДанныеСборкиНаСервере();          
		//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970
		ЭтотОбъект.Записать();		
	КонецЕсли;
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396
&НаКлиенте
Процедура ПоставкаПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеИзмененияПоставки", ЭтотОбъект);
		ТекстВопроса = "Изменить поставку, данные будут утеряны?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДанныеСборкиНаСервере();
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчанию()
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396
&НаКлиенте
Процедура ОбновитьДанныеПоЗаказам(Команда)  
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеИзмененияПоставки", ЭтотОбъект);
		ТекстВопроса = "Обновить данные по заказам в поставке? Несохранённые данные в табличной части будут утеряны?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЭтотОбъект.Записать();
		//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970		
		ЗаполнитьДанныеСборкиНаСервере(Истина);          
		//ЗаполнитьДанныеСборкиНаСервере();          
		//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396

#КонецОбласти 

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396
&НаКлиенте
Процедура ПрикрепитьКиЗы(Команда)  

	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", Объект.Профиль);
	ПараметрыФормы.Вставить("Товары", Объект.Товары);
	//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710      
	ПараметрыФормы.Вставить("СтараяФормаУпаковки", Ложь); 
	//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396
&НаКлиенте
Процедура ВзятьВРаботу(Команда) 
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		Элементы.Товары.ДанныеСтроки(Строка).СтатусСборки = ПредопределенноеЗначение("Перечисление.ИС_MP_СтатусыСборки.ВРаботе");
	КонецЦикла; 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396
&НаКлиенте
Процедура ПечатьЗаданияНаОтбор(Команда)
	ТабДок = ПечатьЗаданияНаОтборНаСервере();
	
	
	//КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	//КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров", Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(10, 0)));
	//КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	//КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ОфисныеДокументы");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	//КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	//КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	//
	//НСтр = КоллекцияПечатныхФорм.Добавить();
	//НСтр.ИмяМакета = "ЗаданиеНаОтборРазмещениеТовара";
	//НСтр.ИмяВРЕГ = "ЗАДАНИЕНАОТБОРРАЗМЕЩЕНИЕТОВАРА";
	//НСтр.Экземпляров = 1;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаданиеНаОтборРазмещениеТовара");
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,,ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997     

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	ВыполнитьПроверкуНаПечать(Результат);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Штрихкод));
	ДанныеШтрихкода.Вставить("Количество", 1);   	
	
	//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", Ложь);
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода);
			                                                  
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода, ПараметрыСканирования);
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
				
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		ОбработатьШтрихкоды(СокрЛП(Данные.Штрихкод));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()

	Для Каждого Строка Из Объект.Товары Цикл
		Если Строка.СтатусСборки = Перечисления.ИС_MP_СтатусыСборки.ПустаяСсылка() Тогда
			Строка.СтатусСборки = Перечисления.ИС_MP_СтатусыСборки.ОжидаетСборки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода)
	
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
	//ДанныеШтрихкода = РезультатОбработкиШтрихкода;
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686	
	
	РезультатРазбора = РазборКодаМаркировкиНаСервере(ДанныеШтрихкода.НормализованныйШтрихкод);
	
	Если РезультатРазбора <> Неопределено Тогда
		ДанныеШтрихкодаУпаковки = ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора);
		ДанныеШтрихкода = ДанныеШтрихкодаУпаковки;
	Иначе
		ДанныеШтрихкодаУпаковки = Неопределено;
	КонецЕсли;
	
	Если ДанныеШтрихкодаУпаковки = Неопределено И Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ЗвукШтрихкодОтстутствуетВБазе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду " + ДанныеШтрихкода.Штрихкод);
		Возврат;		
	КонецЕсли;	
	
	ТекущийЗаказ = Неопределено;
	СтрокаДанныеСборки = Неопределено;   
	
	Для Каждого Заказ Из Объект.Товары Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81140
		Если Заказ.СтатусWB = ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled") Или
			Заказ.СтатусWB = ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.canceled_by_client") Или
			Заказ.СтатусWB = ПредопределенноеЗначение("Перечисление.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries.declined_by_client") Тогда
			Продолжить;
		КонецЕсли;
		//- ИнфоСофт Стояк Ю.К. 12.08.2024 УА #81140
		
		Если Заказ.Номенклатура = ДанныеШтрихкода.Номенклатура И Заказ.Характеристика = ДанныеШтрихкода.Характеристика И Не Заказ.ЭтикеткаРаспечатана Тогда
			
			ТекущийЗаказ = Заказ;						
			Прервать;
			
		КонецЕсли;
		
		Если ТекущийЗаказ <> Неопределено Тогда
			Прервать;
		КонецЕсли;		
		
	КонецЦикла;	
	
	Если ТекущийЗаказ = Неопределено Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 	 
		ЗвукТоварОтсутствуетВЗаказе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.");
		Возврат;                                                                                                                       
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	Иначе		
		ЗвукТоварНайден();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	КонецЕсли;	
	
	ЭтикеткаРаспечатана = Ложь;
	
	ТекущийЗаказ.КоличествоФакт = ТекущийЗаказ.КоличествоФакт + 1;
	ТекущийЗаказ.ШтрихкодУпаковки = ДанныеШтрихкода.ШтрихкодУпаковки;
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686	
	ТекущийЗаказ.Штрихкод = РезультатОбработкиШтрихкода.ДанныеШтрихкода.Штрихкод;
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
	//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	ТекущийЗаказ.КИЗ = ДанныеШтрихкода.НормализованныйШтрихкод;
	//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81140
	Если ДобавлятьСканируемыйКИЗВСвязаннуюРТУ Тогда
		ДобавитьКИЗВРТУ(ТекущийЗаказ.Заказ, ТекущийЗаказ.ШтрихкодУпаковки);
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81140
	
	//Если РезультатРазбора <> Неопределено Тогда
	//	ТекущийЗаказ.КИЗ = ДанныеШтрихкода.КИЗ;			
	//КонецЕсли;
	
	Если ТекущийЗаказ.КоличествоФакт = ТекущийЗаказ.КоличествоЗаказ Тогда		
							
		Попытка
			
			ВыполнитьПечатьЭтикетки(ТекущийЗаказ); 				
			ТекущийЗаказ.ЭтикеткаРаспечатана = ЭтикеткаРаспечатана; 			
			//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
			ТекущийЗаказ.СтатусСборки = ПредопределенноеЗначение("Перечисление.ИС_MP_СтатусыСборки.Собран");
			//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
			
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаКлиенте
Процедура ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки) 
	
	Если Объект.ПечататьЭтикеткиЗаказа Тогда
		ЭтикеткаЗаказа = ПолучитьЭтикеткиНаСервере(СтрокаДанныеСборки.Заказ);
						
		Если ЗначениеЗаполнено(Объект.НастройкаПечатиЭтикеток) Тогда 		
			ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаЗаказа, Объект.НастройкаПечатиЭтикеток);			
		КонецЕсли;
		
		ЭтикеткаЗаказа.Напечатать(); 
						
	КонецЕсли; 
	
	Если Объект.ПечататьШтрихкоды Тогда
		//+ ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648		
		//ЭтикеткаШтрихкода = ПолучитьШтрихкодовНаСервере(СтрокаДанныеСборки.Заказ);  
		//				
		//Если ЗначениеЗаполнено(Объект.НастройкиПечатиШтрихкодов) Тогда 	
		//	ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаШтрихкода, Объект.НастройкиПечатиШтрихкодов);	
		//КонецЕсли;
		//
		//ЭтикеткаШтрихкода.Напечатать();
		
		Если ЗначениеЗаполнено(Объект.НастройкиПечатиШтрихкодов) Тогда
			//+ УТ
			КоличествоКопий = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.НастройкиПечатиШтрихкодов, "КоличествоКопий");
			//- УТ
			Для СЧ = 1 По КоличествоКопий Цикл
				ЭтикеткаШтрихкода = ПолучитьШтрихкодовНаСервере(СтрокаДанныеСборки.Заказ);
				ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаШтрихкода, Объект.НастройкиПечатиШтрихкодов);
				ЭтикеткаШтрихкода.Напечатать();	
			КонецЦикла;
		Иначе
			ЭтикеткаШтрихкода = ПолучитьШтрихкодовНаСервере(СтрокаДанныеСборки.Заказ);
			ЭтикеткаШтрихкода.Напечатать();
		КонецЕсли; 
		//- ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648
		
	КонецЕсли;
	
	ЭтикеткаРаспечатана = Истина;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(СборочноеЗадание)

	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЭтикеток";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.Номер КАК СборочноеЗаданиеНомер,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.vendorCode КАК СборочноеЗаданиеНоменклатураWBvendorCode,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.Наименование КАК СборочноеЗаданиеНоменклатураWBНаименование,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.Код КАК СборочноеЗаданиеНоменклатураWBКод
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|ГДЕ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание В(&МассивСсылок)";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст);
	
	Запрос.УстановитьПараметр("МассивСсылок", СборочноеЗадание); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать этикетки WildBerries");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
						
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл  
				
		ОбластьЭтикетка.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.Этикетка.Получить()); 
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396
&НаСервере
Функция ПолучитьШтрихкодовНаСервере(СборочноеЗадание)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьШтрихкодов";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_Штрихкод58х40");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Цвет
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК НомерЗаказаСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК КодНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК РазмерСВБ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК ЦветСВБ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗаданиеskus.Штрихкод, """")) КАК ШтрихкодСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК НаименованиеНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура1С,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика1С
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	|		ПО (ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка)
	|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Цвет КАК ВТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование,
	|	ИС_WB_СборочноеЗадание.Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика
	|;
	|" + ИС_МП_Печать.ТекстЗапросаПараметровПечатиШтрихкодов();
	
	Запрос.УстановитьПараметр("МассивСсылок", СборочноеЗадание); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать штрихкоды WildBerries");
		Возврат Табдок;	
	КонецЕсли;
	
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл
		
		//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		//ОбластьЭтикетка.Параметры.Наименование  = Выборка.Наименование;
		//ОбластьЭтикетка.Параметры.Артикул = Выборка.vendorCode;
		//ОбластьЭтикетка.Параметры.Цвет	  = Выборка.Цвет;
		//ОбластьЭтикетка.Параметры.Размер  = Выборка.techSize;
		ЗаполнитьЗначенияСвойств(ОбластьЭтикетка.Параметры, Выборка);
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		
		ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
		
		ПараметрыШК.Ширина = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШК.Высота = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);

		ПараметрыШК.РазмерШрифта = 10;
		//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816		
		//ПараметрыШК.Штрихкод = Выборка.Штрихкод;
		ПараметрыШК.Штрихкод = Выборка.ШтрихкодСМаркетплейса;
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		ПараметрыШК.Масштабировать = Истина;
		ПараметрыШК.СохранятьПропорции = Истина;
		ПараметрыШК.ВертикальноеВыравнивание = 2; 
		
		СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
		
		Если СтруктураКартинки.Результат Тогда	
			ОбластьЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
		КонецЕсли;  
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
		
		Табдок.Вывести(ОбластьЭтикетка);
		
	КонецЦикла;    
	
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Функция ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", РезультатРазбора.НормализованныйКодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	Результат.Вставить("Характеристика", Выборка.Характеристика);
	Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.КодМаркировки); 
	Результат.Вставить("ШтрихкодУпаковки", Выборка.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Функция ПолучитьПринтерДляПечати()	
	Возврат Объект.НастройкаПечатиЭтикеток.ИмяПринтера;	
КонецФункции //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К 22.07.24 УА #76396
&НаСервере
Функция РазборКодаМаркировкиНаСервере(НормализованныйШтрихкод)	
	Возврат ИС_MP_Маркировка.РазборКодаМаркировки(НормализованныйШтрихкод);	
КонецФункции //- ИнфоСофт Стояк Ю.К 22.07.24 УА #76396

//+ ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396
&НаСервере
Процедура ЗаполнитьДанныеСборкиНаСервере(Обновление = Ложь)
	
	//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970	
	Если Не Обновление Тогда
		Объект.Товары.Очистить();
	КонецЕсли;                                  
	//Объект.Товары.Очистить();
	//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81970
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание КАК СборочноеЗадание,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.РазмерWB КАК СборочноеЗаданиеРазмерWB,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partA + "" "" + ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.partB КАК ДанныеQR,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|ГДЕ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка = &Поставка
	//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	|	И НЕ ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)
	//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.СборочноеЗадание КАК СборочноеЗадание,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика	
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_СборочныеЗадания.СборочноеЗаданиеРазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СборочныеЗадания.СборочноеЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.СборочноеЗадание КАК Заказ,
	|	ВТ_СборочныеЗадания.СборочноеЗадание.Номер КАК НомерОтправления,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	//+ ИнфоСофт Заварин К.В. 22.02.25 УА #73904
	|	ВЫБОР
	|		КОГДА ВТ_Номенклатура.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркируемыйТовар,
	|	ВЫБОР
	|		КОГДА ИС_MP_ДанныеВыгрузкиКИЗов.КоличествоВыгруженныхТоваров >= 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркировкаПередана,
	//- ИнфоСофт Заварин К.В. 22.02.25 УА #73904
	|	ВТ_СборочныеЗадания.ДанныеQR КАК ДанныеQR,
	|	ВТ_СборочныеЗадания.СтатусWB КАК СтатусWB
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	//+ ИнфоСофт Заварин К.В. 22.02.25 УА #73904
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ДанныеВыгрузкиКИЗов КАК ИС_MP_ДанныеВыгрузкиКИЗов
	|			ПО ВТ_Номенклатура.Номенклатура = ИС_MP_ДанныеВыгрузкиКИЗов.Номенклатура
	|				И ВТ_Номенклатура.Характеристика = ИС_MP_ДанныеВыгрузкиКИЗов.Характеристика
	|				И ВТ_Номенклатура.СборочноеЗадание = ИС_MP_ДанныеВыгрузкиКИЗов.ЗаказМП
	//- ИнфоСофт Заварин К.В. 22.02.25 УА #73904
	|		ПО ВТ_СборочныеЗадания.СборочноеЗадание = ВТ_Номенклатура.СборочноеЗадание";
	
	Запрос.УстановитьПараметр("Поставка", Объект.Поставка);
	
	РезультатЗапроса = Запрос.Выполнить();
	                                              	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отбор = Новый Структура("Заказ", Выборка.Заказ);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТЗ = Объект.Товары.Добавить();
			СтрокаТЗ.КоличествоЗаказ = 1;
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		Иначе
			НайденныеСтроки[0].СтатусWB = Выборка.СтатусWB;
			НайденныеСтроки[0].ДанныеQR = Выборка.ДанныеQR;
			НайденныеСтроки[0].Номенклатура = Выборка.Номенклатура;
			НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396
&НаСервере
Процедура ВыполнитьНастройкуТабличногоДокумента(Этикетка, НастройкиПечати)
	
	Этикетка.ИмяПринтера = НастройкиПечати.ИмяПринтера; 
	Этикетка.ПолеСлева = НастройкиПечати.Слева;
	Этикетка.ПолеСправа = НастройкиПечати.Справа;
	Этикетка.ПолеСнизу = НастройкиПечати.Снизу;
	Этикетка.ПолеСверху = НастройкиПечати.Сверху;	
	Этикетка.РазмерКолонтитулаСверху = НастройкиПечати.КолонтитулыСверху;
	Этикетка.РазмерКолонтитулаСнизу = НастройкиПечати.КолонтитулыСнизу; 
	Этикетка.ЭкземпляровНаСтранице = НастройкиПечати.ЭкземпляровНаСтраницу; 
	
	Если НастройкиПечати.ОриентацияСтраницы = 0 Тогда 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если НастройкиПечати.Масштаб = 0 Тогда 
		Этикетка.АвтоМасштаб = Истина;
	Иначе 
		Этикетка.АвтоМасштаб = Ложь;
		Этикетка.МасштабПечати = НастройкиПечати.МасштабЗначение;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396
&НаКлиенте
Процедура ПоказатьВопросЗавершениеИзмененияПоставки(Результат, Объект) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеСборкиНаСервере();
	Иначе
		Возврат;	
	КонецЕсли;  
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 30.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396
&НаСервере
Функция ПечатьЗаданияНаОтборНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|	И ИС_WB_СборочноеЗадание.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО (ВТ_Заказы.Заказ = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение)
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка <> ЗНАЧЕНИЕ(Документ.РасходныйОрдерНаТовары.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка";     
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Товары.Выгрузить(,"Заказ"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОбъектов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			
			НайденныйЭлемент = МассивОбъектов.Найти(ВыборкаДетальныеЗаписи.Ссылка);  
			
			Если НайденныйЭлемент = Неопределено Тогда
				МассивОбъектов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЕсли;
			
		КонецЕсли;     
		
	КонецЦикла;  
	
	Если МассивОбъектов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдено расходных ордеров для печати задания на отбор");	
	КонецЕсли;

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ПараметрыПечати.Вставить("ТипЗадания", "ЗаданиеНаОтбор"); 
	ПараметрыПечати.Вставить("ПечатьПоДаннымДокумента", Неопределено);
		
	ТабДок = Обработки.ПечатьЗаданияНаОтборРазмещениеТоваров.СформироватьЗаданиеНаОтборРазмещениеТовара(МассивОбъектов, Новый СписокЗначений, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 31.07.2024 УА #76396

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81140
&НаСервере
Функция ДобавитьКИЗВРТУ(Заказ, ДанныеШтрихкода)
	
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81140

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("ПроигрыватьЗвукиПриСканировании");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Объект.Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, МассивНаименованийПараметров);
	
	//+ ИнфоСофт Власова И.С. 04.02.25 УА #92991
	//Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") Тогда
	Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") И Не Настройки.ПроигрыватьЗвукиПриСканировании = Неопределено Тогда
	//- ИнфоСофт Власова И.С. 04.02.25 УА #92991
		Возврат Настройки.ПроигрыватьЗвукиПриСканировании;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762


//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 
//Реализован функционал воспроизведения дополнительного звука при сканировании товаров в документе "УпаковкаТоваров"
&НаКлиенте
Процедура ПроигратьЗвук(ИмяФайла) 
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//+ ИнфоСофт Власова И.С. 27.01.25 УА #91984
	//Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
	//	Или Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		И Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 27.01.25 УА #91984
	
	Константа = ПолучитьЗначениеПараметра(); 
	
	Если Константа Тогда  
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварНайден()
	
	ИмяФайла = КаталогДокументов() + "scanOK.wav";
	ПроигратьЗвук(ИмяФайла);
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварОтсутствуетВЗаказе()
	
	ИмяФайла = КаталогДокументов() + "scanAlarm.wav";
	ПроигратьЗвук(ИмяФайла); 
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукШтрихкодОтстутствуетВБазе()
	ИмяФайла = КаталогДокументов() + "scanERROR.wav";
	ПроигратьЗвук(ИмяФайла); 	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

#КонецОбласти
